## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 13 to add, 16 to change, 13 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                        |
|----------|-----------------------------------------------------------------------------------|
| add      | `aws_cloudwatch_event_rule.form_archiver_lambda_trigger`                          |
|          | `aws_cloudwatch_event_rule.nagware_lambda_trigger`                                |
|          | `aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger`                        |
|          | `aws_cloudwatch_event_rule.response_archiver_lambda_trigger`                      |
|          | `aws_cloudwatch_event_target.form_archiver_lambda_trigger`                        |
|          | `aws_cloudwatch_event_target.nagware_lambda_trigger`                              |
|          | `aws_cloudwatch_event_target.reliability_dlq_lambda_trigger`                      |
|          | `aws_cloudwatch_event_target.response_archiver_lambda_trigger`                    |
| delete   | `aws_cloudwatch_event_rule.cron_2am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_3am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_4am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_5am_every_business_day`                           |
|          | `aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day`         |
|          | `aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day`         |
|          | `aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day`     |
|          | `aws_cloudwatch_event_target.run_nagware_lambda_every_day`                        |
| update   | `aws_lambda_function.audit_logs`                                                  |
|          | `aws_lambda_function.form_archiver`                                               |
|          | `aws_lambda_function.nagware`                                                     |
|          | `aws_lambda_function.reliability`                                                 |
|          | `aws_lambda_function.reliability_dlq_consumer`                                    |
|          | `aws_lambda_function.response_archiver`                                           |
|          | `aws_lambda_function.submission`                                                  |
|          | `aws_lambda_function.vault_integrity`                                             |
|          | `aws_s3_object.audit_logs_code`                                                   |
|          | `aws_s3_object.form_archiver_code`                                                |
|          | `aws_s3_object.nagware_code`                                                      |
|          | `aws_s3_object.reliability_code`                                                  |
|          | `aws_s3_object.reliability_dlq_consumer_code`                                     |
|          | `aws_s3_object.response_archiver_code`                                            |
|          | `aws_s3_object.submission_code`                                                   |
|          | `aws_s3_object.vault_integrity_code`                                              |
| recreate | `aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda`     |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda` |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda`              |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda`                    |
|          | `aws_signer_signing_job.vault_integrity[0]`                                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron_2am_every_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_2am_every_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_2am_every_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-2am" -> null
      - description         = "Fires every day at 2am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-day-at-2am" -> null
      - is_enabled          = true -> null
      - name                = "every-day-at-2am" -> null
      - schedule_expression = "cron(0 7 * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.cron_3am_every_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_3am_every_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_3am_every_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-3am" -> null
      - description         = "Fires every day at 3am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-day-at-3am" -> null
      - is_enabled          = true -> null
      - name                = "every-day-at-3am" -> null
      - schedule_expression = "cron(0 8 * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.cron_4am_every_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_4am_every_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_4am_every_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-4am" -> null
      - description         = "Fires every day at 4am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-day-at-4am" -> null
      - is_enabled          = true -> null
      - name                = "every-day-at-4am" -> null
      - schedule_expression = "cron(0 9 * * ? *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.cron_5am_every_business_day will be destroyed
  # (because aws_cloudwatch_event_rule.cron_5am_every_business_day is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron_5am_every_business_day" {
      - arn                 = "arn:aws:events:ca-central-1:687401027353:rule/every-business-day-at-5am" -> null
      - description         = "Fires every business day at 5am EST" -> null
      - event_bus_name      = "default" -> null
      - id                  = "every-business-day-at-5am" -> null
      - is_enabled          = true -> null
      - name                = "every-business-day-at-5am" -> null
      - schedule_expression = "cron(0 10 ? * MON-FRI *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_event_rule.form_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "form_archiver_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 4am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "form-archiver-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 9 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.nagware_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "nagware_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every Tuesday, Thursday and Sunday at 5am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "nagware-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 10 * * TUE,THU,SUN *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "reliability_dlq_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 2am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "reliability-dlq-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.response_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "response_archiver_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 3am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "response-archiver-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.form_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "form_archiver_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "form-archiver-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.nagware_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "nagware_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Nagware"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "nagware-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.reliability_dlq_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "reliability_dlq_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "reliability-dlq-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.response_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "response_archiver_lambda_trigger" {
      + arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "response-archiver-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_archive_form_responses_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Response_Archiver" -> null
      - event_bus_name = "default" -> null
      - id             = "every-day-at-3am-terraform-2023120721571581470000000e" -> null
      - rule           = "every-day-at-3am" -> null
      - target_id      = "terraform-2023120721571581470000000e" -> null
    }

  # aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_archive_form_templates_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Archive_Form_Templates" -> null
      - event_bus_name = "default" -> null
      - id             = "every-day-at-4am-terraform-2023120721571539640000000b" -> null
      - rule           = "every-day-at-4am" -> null
      - target_id      = "terraform-2023120721571539640000000b" -> null
    }

  # aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_dead_letter_queue_consumer_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Reliability_DLQ_Consumer" -> null
      - event_bus_name = "default" -> null
      - id             = "every-day-at-2am-terraform-2023120721571560770000000d" -> null
      - rule           = "every-day-at-2am" -> null
      - target_id      = "terraform-2023120721571560770000000d" -> null
    }

  # aws_cloudwatch_event_target.run_nagware_lambda_every_day will be destroyed
  # (because aws_cloudwatch_event_target.run_nagware_lambda_every_day is not in configuration)
  - resource "aws_cloudwatch_event_target" "run_nagware_lambda_every_day" {
      - arn            = "arn:aws:lambda:ca-central-1:687401027353:function:Nagware" -> null
      - event_bus_name = "default" -> null
      - id             = "every-business-day-at-5am-terraform-2023120721571552610000000c" -> null
      - rule           = "every-business-day-at-5am" -> null
      - target_id      = "terraform-2023120721571552610000000c" -> null
    }

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2024-01-11T18:12:30.000+0000" -> (known after apply)
      ~ s3_object_version              = "30DMkTP0oJkmf94PSeysgJpD70IqbQX0" -> (known after apply)
      ~ source_code_hash               = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "7Az5+gVeUAJKtZaemCfiav5vjpznwCwGLx+CjeRfS3c="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2024-01-11T18:12:30.000+0000" -> (known after apply)
      ~ s3_object_version              = "79XIc6VR2aQuYzaduPsoOatLGFISakMg" -> (known after apply)
      ~ source_code_hash               = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "cE/SCyrExr6jjFMcDrp3E+9aEj7SBm1XXWENznTQNHc="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2024-01-12T15:13:35.000+0000" -> (known after apply)
      ~ s3_object_version              = "n2CchU5tzvaGrJ6t8zKWUGLAvN.9tWij" -> (known after apply)
      ~ source_code_hash               = "MiiK5e/6TJjDywdEaAWyRxtz746ExWQdSBcWjBxYyPk=" -> "8TdGG4R8ZeaQEognSWPBLL9k/9Fzb2cRG5Mx7IMmbY4="
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "SNS_ERROR_TOPIC_ARN"       = "arn:aws:sns:ca-central-1:687401027353:alert-critical" -> null
                # (10 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2024-01-12T15:13:35.000+0000" -> (known after apply)
      ~ s3_object_version              = "2lirn5yEVP_uG9YM3ISy6i45Nc_DI.cg" -> (known after apply)
      ~ source_code_hash               = "Y9H8sLPZL9F6011TefCnrblzwHpvwKdIvkqDSPaxVK8=" -> "L5QB5AQZ7QNDw/c5fZ6NvHdfhAE4yH1BpFSTB8qEYh0="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "Reliability_DLQ_Consumer"
      ~ last_modified                  = "2024-01-11T18:12:30.000+0000" -> (known after apply)
      ~ s3_object_version              = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
      ~ source_code_hash               = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "oCcwRvn+61JjESReCHNUs4ai0vL1tXU8tcuIyszomMY="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "Response_Archiver"
      ~ last_modified                  = "2024-01-15T20:01:26.000+0000" -> (known after apply)
      ~ s3_object_version              = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
      ~ source_code_hash               = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "3OPLAzpg7ZPXXgG9lHFGIbGT5bvixXFSIkpL4HA8jZ4="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2024-01-11T18:12:30.000+0000" -> (known after apply)
      ~ s3_object_version              = "W0HyLw2ExKKd03J3kzc74rvXTZwXg6tc" -> (known after apply)
      ~ source_code_hash               = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "C6i1e9rqgKBW0riC0j+CkWHhinASaXQxNYV6Ditcp1I="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-01-25T17:03:56.000+0000" -> (known after apply)
      ~ s3_bucket                      = "forms-staging-lambda-code" -> (known after apply)
      ~ s3_key                         = "signed/29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "qOTvQ/McglpvokeUssErXp53M9z4rSXi8YJrDGJKMOk="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_archive_form_responses_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-3am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-2am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_form_archiver_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-day-at-4am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda must be replaced
-/+ resource "aws_lambda_permission" "allow_cloudwatch_to_run_nagware_lambda" {
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      ~ source_arn          = "arn:aws:events:ca-central-1:687401027353:rule/every-business-day-at-5am" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "7Az5+gVeUAJKtZaemCfiav5vjpznwCwGLx+CjeRfS3c="
        tags                   = {}
      ~ version_id             = "30DMkTP0oJkmf94PSeysgJpD70IqbQX0" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "Az0liG599yfRg7cqDAtpcwSYHtgtsQI2m7K2x/krsxY=" -> "cE/SCyrExr6jjFMcDrp3E+9aEj7SBm1XXWENznTQNHc="
        tags                   = {}
      ~ version_id             = "79XIc6VR2aQuYzaduPsoOatLGFISakMg" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.nagware_code will be updated in-place
  ~ resource "aws_s3_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "MiiK5e/6TJjDywdEaAWyRxtz746ExWQdSBcWjBxYyPk=" -> "8TdGG4R8ZeaQEognSWPBLL9k/9Fzb2cRG5Mx7IMmbY4="
        tags                   = {}
      ~ version_id             = "n2CchU5tzvaGrJ6t8zKWUGLAvN.9tWij" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "Y9H8sLPZL9F6011TefCnrblzwHpvwKdIvkqDSPaxVK8=" -> "L5QB5AQZ7QNDw/c5fZ6NvHdfhAE4yH1BpFSTB8qEYh0="
        tags                   = {}
      ~ version_id             = "2lirn5yEVP_uG9YM3ISy6i45Nc_DI.cg" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_dlq_consumer_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_dlq_consumer_code" {
        id                     = "reliability_dlq_consumer_code"
      ~ source_hash            = "F7WbeUnrxxXYZkj7tkJyJcFV6inBl3QWsV9AzLcvfB4=" -> "oCcwRvn+61JjESReCHNUs4ai0vL1tXU8tcuIyszomMY="
        tags                   = {}
      ~ version_id             = "BvpQY3NZQMaRMOsGpoZWavOy3AZupOJY" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.response_archiver_code will be updated in-place
  ~ resource "aws_s3_object" "response_archiver_code" {
        id                     = "response_archiver_code"
      ~ source_hash            = "iCOPYEkuyPrXdcFRLr6qL6swUo/kXiUZTdHb0tWWuOE=" -> "3OPLAzpg7ZPXXgG9lHFGIbGT5bvixXFSIkpL4HA8jZ4="
        tags                   = {}
      ~ version_id             = "Hooe7gUS8n2KyXfCqL6CuX9xUeCBapo6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.submission_code will be updated in-place
  ~ resource "aws_s3_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "C6i1e9rqgKBW0riC0j+CkWHhinASaXQxNYV6Ditcp1I="
        tags                   = {}
      ~ version_id             = "W0HyLw2ExKKd03J3kzc74rvXTZwXg6tc" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.vault_integrity_code will be updated in-place
  ~ resource "aws_s3_object" "vault_integrity_code" {
        id                     = "vault_integrity_code"
      ~ source_hash            = "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws=" -> "qOTvQ/McglpvokeUssErXp53M9z4rSXi8YJrDGJKMOk="
        tags                   = {}
      ~ version_id             = "T8_Y3lOs.tGjMhrm1ldzVlrAUqMcFexl" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_signer_signing_job.vault_integrity[0] must be replaced
-/+ resource "aws_signer_signing_job" "vault_integrity" {
      ~ completed_at               = "2024-01-11T18:12:31Z" -> (known after apply)
      ~ created_at                 = "2024-01-11T18:12:29Z" -> (known after apply)
      ~ id                         = "29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ job_id                     = "29941171-a3bb-4511-be92-2c7d9ddd8912" -> (known after apply)
      ~ job_invoker                = "687401027353" -> (known after apply)
      ~ job_owner                  = "687401027353" -> (known after apply)
      ~ platform_display_name      = "AWS Lambda" -> (known after apply)
      ~ platform_id                = "AWSLambda-SHA384-ECDSA" -> (known after apply)
      ~ profile_version            = "3cak3nO7rT" -> (known after apply)
      ~ requested_by               = "arn:aws:iam::687401027353:user/GitHub_Terraform" -> (known after apply)
      ~ revocation_record          = [] -> (known after apply)
      ~ signature_expires_at       = "2035-04-11T18:12:31Z" -> (known after apply)
      ~ signed_object              = [
          - {
              - s3 = [
                  - {
                      - bucket = "forms-staging-lambda-code"
                      - key    = "signed/29941171-a3bb-4511-be92-2c7d9ddd8912"
                    },
                ]
            },
        ] -> (known after apply)
      ~ status                     = "Succeeded" -> (known after apply)
      ~ status_reason              = "Signing Succeeded" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          ~ s3 {
              ~ version = "T8_Y3lOs.tGjMhrm1ldzVlrAUqMcFexl" # forces replacement -> (known after apply) # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 13 to add, 16 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.audit_logs"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
